Returns the geometric curve within a geometric loop that defines the area.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetCurve() or GetLoops() method instead.")]
public Curve this[
	int curveIndex
] { get; }
  Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetCurve() or GetLoops() method instead.")> _
Public ReadOnly Property Curve ( _
	curveIndex As Integer _
) As Curve
	Get
  Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetCurve() or GetLoops() method instead.")]
public:
property Curve^ Curve[int curveIndex] {
	Curve^ get (int curveIndex);
}
 Parameters
  curveIndex
 Type:  System Int32
 The index curve in the BoundaryConditions.
 Return Value
 If successful, returns the curve pointer. Otherwise returns    a null reference (  Nothing  in Visual Basic)  .
 Remarks
 The curve index should be between 0 and NumCurves-1.
 See Also
  BoundaryConditions Class
  Autodesk.Revit.DB.Structure Namespace